#+STARTUP: showall

#+TITLE:     Class 4: VMWare Ubuntu Virtual Machine
#+AUTHOR:    Kurt Schwehr
#+EMAIL:     schwehr@ccom.unh.edu
#+DATE:      <2011-09-08 Thu>
#+DESCRIPTION: Marine Research Data Manipulation and Practices
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:t d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_HOME: http://vislab-ccom.unh.edu/~schwehr/Classes/2011/esci895-researchtools/

** Shutdown from Ubuntu

If you a full shutdown (next to the hibernate and suspend in the menu
under the "power button" on the top right, the system will go through
the full clean shutdown of all processes.  While I have had excellent
experiences with leaving Ubuntu servers running in remote locations
for up to 2 years without a reboot, I would recommend rebooting at
least every week or two with a desktop Ubuntu environment.

An example of a Linux server that has not been rebooted in almost a year:

#+BEGIN_SRC sh :export both
uptime
#+END_SRC

#+results:
| 04:45:05 up 342 days | 16:56 |  1 user,  load average: 0.33, 0.17, 0.11 |

